app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 7]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 7]]
---
  <%= link_to "Back to list",articles_path %>
  <h3>Comments List (<%= @article.comments.size %>) </h3>